onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДЗКонтактныеЛица</name>
    <type>
      <types>CatalogRef.ДЗ_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДЗСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДЗЗаказ</name>
    <type>
      <types>EnumRef.ДЗ_СтатусЗаказа</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	  // Сушкова Е.Н. Домашнее задание по теме "Внесение изменений в конфигурацию на поддержке"
	   Если Элементы.Найти ( "КонтактныеЛица") = Неопределено Тогда
		ДобавлениеКонтактныеЛица = Элементы.Добавить("ДЗКонтактныеЛица",Тип("ПолеФормы"),Элементы.ГруппаШапкаПраво);
		ДобавлениеКонтактныеЛица.ПутьКДанным = "Объект.ДЗКонтактныеЛица";
		ДобавлениеКонтактныеЛица.Вид = ВидПоляФормы.ПолеВвода;
		ДобавлениеКонтактныеЛица.Заголовок = "Контактное лицо"; 		
	КонецЕсли; 

	Если Элементы.Найти ("Скидка") = Неопределено Тогда
		ДобавлениеСкидка = Элементы.Добавить("ДЗСкидка",Тип("ПолеФормы"),Элементы.ГруппаШапкаПраво);
		ДобавлениеСкидка.ПутьКДанным = "Объект.ДЗСкидка";
		ДобавлениеСкидка.Вид = ВидПоляФормы.ПолеВвода;		
		ДобавлениеСкидка.Заголовок = "Скидка";
		ДобавлениеСкидка.УстановитьДействие("ПриИзменении","ПриИзмененииСкидки");
		
		
	КонецЕсли;  

	Если Элементы.Найти ("ПересчитатьСумму") = Неопределено Тогда
		Команда = Команды.Добавить ("ПересчитатьСумму"); 
		Команда.Заголовок = "Пересчитать сумму";
		Команда.Действие = "КомандаПересчитатьСумму";
		
		КнопкаКоманды = Элементы.Добавить("ПересчитатьСумму",Тип ("КнопкаФормы"), Элементы.ГруппаШапкаПраво);
		КнопкаКоманды.ИмяКоманды = "ПересчитатьСумму";
		КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
		КнопкаКоманды.Картинка = БиблиотекаКартинок.Обновить; 
		КнопкаКоманды.Отображение = ОтображениеКнопки.Картинка;
		
	КонецЕсли;	
	  // Сушкова Е.Н. Конец домашнего задания	
	
КонецПроцедуры

&НаКлиенте 
 Процедура КомандаПересчитатьСумму();

  // Сушкова Е.Н. Домашнее задание по теме "Внесение изменений в конфигурацию на поддержке"  
  
  ТЗТовары = Объект.Товары; 
 ТЗУслуги = Объект.Услуги;	 
 Для Каждого ЭлементаТЗТовары из ТЗТовары Цикл 		 
	  РассчитатьСуммуСтроки(ЭлементаТЗТовары);		 
 КонецЦикла; 	 
 Для Каждого ЭлементаТЗУслуги из ТЗУслуги Цикл 
	 РассчитатьСуммуСтроки(ЭлементаТЗУслуги);
 КонецЦикла; 
 
  // Сушкова Е.Н. Конец домашнего задания	
	 				
КонецПроцедуры

&НаКлиенте 
  Асинх Процедура ПриИзмененииСкидки() 
	  
  // Сушкова Е.Н. Домашнее задание по теме "Внесение изменений в конфигурацию на поддержке" 
  
  ТЗТовары = Объект.Товары;  
  ТЗУслуги = Объект.Услуги;
  Если Не ЗначениеЗаполнено(Объект.Товары) и Не ЗначениеЗаполнено(Объект.Услуги) тогда
	  Возврат;		
  Иначе
	  Ответ = Ждать ВопросАсинх ("Пересчитать сумму номенклатуры и услуги с учетом скидки?", РежимДиалогаВопрос.ДаНет);			
	  Если Ответ  =  КодВозвратаДиалога.Да Тогда 			
		  КомандаПересчитатьСумму();		
	  Иначе 
		  Возврат;
	  КонецЕсли; 
  КонецЕсли;	
  
  // Сушкова Е.Н. Конец домашнего задания
	  
  КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
